iot-chalmers/BlueFlood/cpu/cc26xx-cc13xx/lib/cc13xxware/inc/hw_smph.h
//*****************************************************************************
//
// Register: SMPH_O_SMPH29
//
//*****************************************************************************
// Field:     [0] STAT
//
// Status when reading:
//
// 0: Semaphore is taken
// 1: Semaphore is available
//
// Reading the register causes it to change value to 0. Releasing the semaphore
// is done by writing 1.
#define SMPH_SMPH29_STAT                                            0x00000001
#define SMPH_SMPH29_STAT_BITN                                                0
#define SMPH_SMPH29_STAT_M                                          0x00000001
#define SMPH_SMPH29_STAT_S                                                   0

//*****************************************************************************
//
// Register: SMPH_O_SMPH30
//
//*****************************************************************************
// Field:     [0] STAT
//
// Status when reading:
//
// 0: Semaphore is taken
// 1: Semaphore is available
//
// Reading the register causes it to change value to 0. Releasing the semaphore
// is done by writing 1.
#define SMPH_SMPH30_STAT                                            0x00000001
#define SMPH_SMPH30_STAT_BITN                                                0
#define SMPH_SMPH30_STAT_M                                          0x00000001
#define SMPH_SMPH30_STAT_S                                                   0

//*****************************************************************************
//
// Register: SMPH_O_SMPH31
//
//*****************************************************************************
// Field:     [0] STAT
//
// Status when reading:
//
// 0: Semaphore is taken
// 1: Semaphore is available
//
// Reading the register causes it to change value to 0. Releasing the semaphore
// is done by writing 1.
#define SMPH_SMPH31_STAT                                            0x00000001
#define SMPH_SMPH31_STAT_BITN                                                0
#define SMPH_SMPH31_STAT_M                                          0x00000001
#define SMPH_SMPH31_STAT_S                                                   0

//*****************************************************************************
//
// Register: SMPH_O_PEEK0
//
//*****************************************************************************
// Field:     [0] STAT
//
// Status when reading:
//
// 0: Semaphore is taken
// 1: Semaphore is available
//
// Used for semaphore debugging. A read operation will not change register
// value. Register writing is not possible.
#define SMPH_PEEK0_STAT                                             0x00000001
#define SMPH_PEEK0_STAT_BITN                                                 0
#define SMPH_PEEK0_STAT_M                                           0x00000001
#define SMPH_PEEK0_STAT_S                                                    0

//*****************************************************************************
//
// Register: SMPH_O_PEEK1
//
//*****************************************************************************
// Field:     [0] STAT
//
// Status when reading:
//
// 0: Semaphore is taken
// 1: Semaphore is available
//
// Used for semaphore debugging. A read operation will not change register
// value. Register writing is not possible.
#define SMPH_PEEK1_STAT                                             0x00000001
#define SMPH_PEEK1_STAT_BITN                                                 0
#define SMPH_PEEK1_STAT_M                                           0x00000001
#define SMPH_PEEK1_STAT_S                                                    0

//*****************************************************************************
//
// Register: SMPH_O_PEEK2
//
//*****************************************************************************
// Field:     [0] STAT
//
// Status when reading:
//
// 0: Semaphore is taken
// 1: Semaphore is available
//
// Used for semaphore debugging. A read operation will not change register
// value. Register writing is not possible.
#define SMPH_PEEK2_STAT                                             0x00000001
#define SMPH_PEEK2_STAT_BITN                                                 0
#define SMPH_PEEK2_STAT_M                                           0x00000001
#define SMPH_PEEK2_STAT_S                                                    0

//*****************************************************************************
//
// Register: SMPH_O_PEEK3
//
//*****************************************************************************
// Field:     [0] STAT
//
// Status when reading:
//
// 0: Semaphore is taken
// 1: Semaphore is available
//
// Used for semaphore debugging. A read operation will not change register
// value. Register writing is not possible.
#define SMPH_PEEK3_STAT                                             0x00000001
#define SMPH_PEEK3_STAT_BITN                                                 0
#define SMPH_PEEK3_STAT_M                                           0x00000001
#define SMPH_PEEK3_STAT_S                                                    0

//*****************************************************************************
//
// Register: SMPH_O_PEEK4
//
//*****************************************************************************
// Field:     [0] STAT
//
// Status when reading:
//
// 0: Semaphore is taken
// 1: Semaphore is available
//
// Used for semaphore debugging. A read operation will not change register
// value. Register writing is not possible.
#define SMPH_PEEK4_STAT                                             0x00000001
#define SMPH_PEEK4_STAT_BITN                                                 0
#define SMPH_PEEK4_STAT_M                                           0x00000001
#define SMPH_PEEK4_STAT_S                                                    0

//*****************************************************************************
//
// Register: SMPH_O_PEEK5
//
//*****************************************************************************
// Field:     [0] STAT
//
// Status when reading:
//
// 0: Semaphore is taken
// 1: Semaphore is available
//
// Used for semaphore debugging. A read operation will not change register
// value. Register writing is not possible.
#define SMPH_PEEK5_STAT                                             0x00000001
#define SMPH_PEEK5_STAT_BITN                                                 0
#define SMPH_PEEK5_STAT_M                                           0x00000001
#define SMPH_PEEK5_STAT_S                                                    0

//*****************************************************************************
//
// Register: SMPH_O_PEEK6
//
//*****************************************************************************
// Field:     [0] STAT
//
// Status when reading:
//
// 0: Semaphore is taken
// 1: Semaphore is available
//
// Used for semaphore debugging. A read operation will not change register
// value. Register writing is not possible.
#define SMPH_PEEK6_STAT                                             0x00000001
#define SMPH_PEEK6_STAT_BITN                                                 0
#define SMPH_PEEK6_STAT_M                                           0x00000001
#define SMPH_PEEK6_STAT_S                                                    0

//*****************************************************************************
//
// Register: SMPH_O_PEEK7
//
//*****************************************************************************
// Field:     [0] STAT
//
// Status when reading:
//
// 0: Semaphore is taken
// 1: Semaphore is available
//
// Used for semaphore debugging. A read operation will not change register
// value. Register writing is not possible.
#define SMPH_PEEK7_STAT                                             0x00000001
#define SMPH_PEEK7_STAT_BITN                                                 0
#define SMPH_PEEK7_STAT_M                                           0x00000001
#define SMPH_PEEK7_STAT_S                                                    0

//*****************************************************************************
//
// Register: SMPH_O_PEEK8
//
//*****************************************************************************
// Field:     [0] STAT
//
// Status when reading:
//
// 0: Semaphore is taken
// 1: Semaphore is available
//
// Used for semaphore debugging. A read operation will not change register
// value. Register writing is not possible.
#define SMPH_PEEK8_STAT                                             0x00000001
#define SMPH_PEEK8_STAT_BITN                                                 0
#define SMPH_PEEK8_STAT_M                                           0x00000001
#define SMPH_PEEK8_STAT_S                                                    0

//*****************************************************************************
//
// Register: SMPH_O_PEEK9
//
//*****************************************************************************
// Field:     [0] STAT
//
// Status when reading:
//
// 0: Semaphore is taken
// 1: Semaphore is available
//
// Used for semaphore debugging. A read operation will not change register
// value. Register writing is not possible.
#define SMPH_PEEK9_STAT                                             0x00000001
#define SMPH_PEEK9_STAT_BITN                                                 0
#define SMPH_PEEK9_STAT_M                                           0x00000001
#define SMPH_PEEK9_STAT_S                                                    0

//*****************************************************************************
//
// Register: SMPH_O_PEEK10
//
//*****************************************************************************
// Field:     [0] STAT
//
// Status when reading:
//
// 0: Semaphore is taken
// 1: Semaphore is available
//
// Used for semaphore debugging. A read operation will not change register
// value. Register writing is not possible.
#define SMPH_PEEK10_STAT                                            0x00000001
#define SMPH_PEEK10_STAT_BITN                                                0
#define SMPH_PEEK10_STAT_M                                          0x00000001
#define SMPH_PEEK10_STAT_S                                                   0

//*****************************************************************************
//
// Register: SMPH_O_PEEK11
//
//*****************************************************************************
// Field:     [0] STAT
//
// Status when reading:
//
// 0: Semaphore is taken
// 1: Semaphore is available
//
// Used for semaphore debugging. A read operation will not change register
// value. Register writing is not possible.
#define SMPH_PEEK11_STAT                                            0x00000001
#define SMPH_PEEK11_STAT_BITN                                                0
#define SMPH_PEEK11_STAT_M                                          0x00000001
#define SMPH_PEEK11_STAT_S                                                   0

//*****************************************************************************
//
// Register: SMPH_O_PEEK12
//
//*****************************************************************************
// Field:     [0] STAT
//
// Status when reading:
//
// 0: Semaphore is taken
// 1: Semaphore is available
//
// Used for semaphore debugging. A read operation will not change register
// value. Register writing is not possible.
#define SMPH_PEEK12_STAT                                            0x00000001
#define SMPH_PEEK12_STAT_BITN                                                0
#define SMPH_PEEK12_STAT_M                                          0x00000001
#define SMPH_PEEK12_STAT_S                                                   0

//*****************************************************************************
//
// Register: SMPH_O_PEEK13
//
//*****************************************************************************
// Field:     [0] STAT
//
// Status when reading:
//
// 0: Semaphore is taken
// 1: Semaphore is available
//
// Used for semaphore debugging. A read operation will not change register
// value. Register writing is not possible.
#define SMPH_PEEK13_STAT                                            0x00000001
#define SMPH_PEEK13_STAT_BITN                                                0
#define SMPH_PEEK13_STAT_M                                          0x00000001
#define SMPH_PEEK13_STAT_S                                                   0

//*****************************************************************************
//
// Register: SMPH_O_PEEK14
//
//*****************************************************************************
// Field:     [0] STAT
//
// Status when reading:
//
// 0: Semaphore is taken
// 1: Semaphore is available
//
// Used for semaphore debugging. A read operation will not change register
// value. Register writing is not possible.
#define SMPH_PEEK14_STAT                                            0x00000001
#define SMPH_PEEK14_STAT_BITN                                                0
#define SMPH_PEEK14_STAT_M                                          0x00000001
#define SMPH_PEEK14_STAT_S                                                   0

//*****************************************************************************
//
// Register: SMPH_O_PEEK15
//
//*****************************************************************************
// Field:     [0] STAT
//
// Status when reading:
//
// 0: Semaphore is taken
// 1: Semaphore is available
//
// Used for semaphore debugging. A read operation will not change register
// value. Register writing is not possible.
#define SMPH_PEEK15_STAT                                            0x00000001
#define SMPH_PEEK15_STAT_BITN                                                0
#define SMPH_PEEK15_STAT_M                                          0x00000001
#define SMPH_PEEK15_STAT_S                                                   0

//*****************************************************************************
//
// Register: SMPH_O_PEEK16
//
//*****************************************************************************
// Field:     [0] STAT
//
// Status when reading:
//
// 0: Semaphore is taken
// 1: Semaphore is available
//
// Used for semaphore debugging. A read operation will not change register
// value. Register writing is not possible.
#define SMPH_PEEK16_STAT                                            0x00000001
#define SMPH_PEEK16_STAT_BITN                                                0
#define SMPH_PEEK16_STAT_M                                          0x00000001
#define SMPH_PEEK16_STAT_S                                                   0

//*****************************************************************************
//
// Register: SMPH_O_PEEK17
//
//*****************************************************************************
// Field:     [0] STAT
//
// Status when reading:
//
// 0: Semaphore is taken
// 1: Semaphore is available
//
// Used for semaphore debugging. A read operation will not change register
// value. Register writing is not possible.
#define SMPH_PEEK17_STAT                                            0x00000001
#define SMPH_PEEK17_STAT_BITN                                                0
#define SMPH_PEEK17_STAT_M                                          0x00000001
#define SMPH_PEEK17_STAT_S                                                   0

//*****************************************************************************
//
// Register: SMPH_O_PEEK18
//
//*****************************************************************************
// Field:     [0] STAT
//
// Status when reading:
//
// 0: Semaphore is taken
// 1: Semaphore is available
//
// Used for semaphore debugging. A read operation will not change register
// value. Register writing is not possible.
#define SMPH_PEEK18_STAT                                            0x00000001
#define SMPH_PEEK18_STAT_BITN                                                0
#define SMPH_PEEK18_STAT_M                                          0x00000001
#define SMPH_PEEK18_STAT_S                                                   0

//*****************************************************************************
//
// Register: SMPH_O_PEEK19
//
//*****************************************************************************
// Field:     [0] STAT
//
// Status when reading:
//
// 0: Semaphore is taken
// 1: Semaphore is available
//
// Used for semaphore debugging. A read operation will not change register
// value. Register writing is not possible.
#define SMPH_PEEK19_STAT                                            0x00000001
#define SMPH_PEEK19_STAT_BITN                                                0
#define SMPH_PEEK19_STAT_M                                          0x00000001
#define SMPH_PEEK19_STAT_S                                                   0

//*****************************************************************************
//
// Register: SMPH_O_PEEK20
//
//*****************************************************************************
// Field:     [0] STAT
//
// Status when reading:
//
// 0: Semaphore is taken
// 1: Semaphore is available
//
// Used for semaphore debugging. A read operation will not change register
// value. Register writing is not possible.
#define SMPH_PEEK20_STAT                                            0x00000001
#define SMPH_PEEK20_STAT_BITN                                                0
#define SMPH_PEEK20_STAT_M                                          0x00000001
#define SMPH_PEEK20_STAT_S                                                   0

//*****************************************************************************
//
// Register: SMPH_O_PEEK21
//
//*****************************************************************************
// Field:     [0] STAT
//
// Status when reading:
//
// 0: Semaphore is taken
// 1: Semaphore is available
//
// Used for semaphore debugging. A read operation will not change register
// value. Register writing is not possible.
#define SMPH_PEEK21_STAT                                            0x00000001
#define SMPH_PEEK21_STAT_BITN                                                0
#define SMPH_PEEK21_STAT_M                                          0x00000001
#define SMPH_PEEK21_STAT_S                                                   0

//*****************************************************************************
//
// Register: SMPH_O_PEEK22
//
//*****************************************************************************
// Field:     [0] STAT
//
// Status when reading:
//
// 0: Semaphore is taken
// 1: Semaphore is available
//
// Used for semaphore debugging. A read operation will not change register
// value. Register writing is not possible.
#define SMPH_PEEK22_STAT                                            0x00000001
#define SMPH_PEEK22_STAT_BITN                                                0
#define SMPH_PEEK22_STAT_M                                          0x00000001
#define SMPH_PEEK22_STAT_S                                                   0

//*****************************************************************************
//
// Register: SMPH_O_PEEK23
//
//*****************************************************************************
// Field:     [0] STAT
//
// Status when reading:
//
// 0: Semaphore is taken
// 1: Semaphore is available
//
// Used for semaphore debugging. A read operation will not change register
// value. Register writing is not possible.
#define SMPH_PEEK23_STAT                                            0x00000001
#define SMPH_PEEK23_STAT_BITN                                                0
#define SMPH_PEEK23_STAT_M                                          0x00000001
#define SMPH_PEEK23_STAT_S                                                   0

//*****************************************************************************
//
// Register: SMPH_O_PEEK24
//
//*****************************************************************************
// Field:     [0] STAT
//
// Status when reading:
//
// 0: Semaphore is taken
// 1: Semaphore is available
//
// Used for semaphore debugging. A read operation will not change register
// value. Register writing is not possible.
#define SMPH_PEEK24_STAT                                            0x00000001
#define SMPH_PEEK24_STAT_BITN                                                0
#define SMPH_PEEK24_STAT_M                                          0x00000001
#define SMPH_PEEK24_STAT_S                                                   0

//*****************************************************************************
//
// Register: SMPH_O_PEEK25
//
//*****************************************************************************
// Field:     [0] STAT
//
// Status when reading:
//
// 0: Semaphore is taken
// 1: Semaphore is available
//
// Used for semaphore debugging. A read operation will not change register
// value. Register writing is not possible.
#define SMPH_PEEK25_STAT                                            0x00000001
#define SMPH_PEEK25_STAT_BITN                                                0
#define SMPH_PEEK25_STAT_M                                          0x00000001
#define SMPH_PEEK25_STAT_S                                                   0

//*****************************************************************************
//
// Register: SMPH_O_PEEK26
//
//*****************************************************************************
// Field:     [0] STAT
//
// Status when reading:
//
// 0: Semaphore is taken
// 1: Semaphore is available
//
// Used for semaphore debugging. A read operation will not change register
// value. Register writing is not possible.
#define SMPH_PEEK26_STAT                                            0x00000001
#define SMPH_PEEK26_STAT_BITN                                                0
#define SMPH_PEEK26_STAT_M                                          0x00000001
#define SMPH_PEEK26_STAT_S                                                   0

//*****************************************************************************
//
// Register: SMPH_O_PEEK27
//
//*****************************************************************************
// Field:     [0] STAT
//
// Status when reading:
//
// 0: Semaphore is taken
// 1: Semaphore is available
//
// Used for semaphore debugging. A read operation will not change register
// value. Register writing is not possible.
#define SMPH_PEEK27_STAT                                            0x00000001
#define SMPH_PEEK27_STAT_BITN                                                0
#define SMPH_PEEK27_STAT_M                                          0x00000001
#define SMPH_PEEK27_STAT_S                                                   0

//*****************************************************************************
//
// Register: SMPH_O_PEEK28
//
//*****************************************************************************
// Field:     [0] STAT
//
// Status when reading:
//
// 0: Semaphore is taken
// 1: Semaphore is available
//
// Used for semaphore debugging. A read operation will not change register
// value. Register writing is not possible.
#define SMPH_PEEK28_STAT                                            0x00000001
#define SMPH_PEEK28_STAT_BITN                                                0
#define SMPH_PEEK28_STAT_M                                          0x00000001
#define SMPH_PEEK28_STAT_S                                                   0

